Repository: BogdanovaIV/payment-management
Catalog: django_api/locale/*/LC_MESSAGES/django.po
Languages: kk, ru

source: Invalid basic header. No credentials provided.
kk: Жарамсыз негізгі тақырып. Ешқандай тіркелгі деректері берілмеген.
ru: Недействительный базовый заголовок. Учетные данные не предоставлены.

source: Invalid basic header. Credentials string should not contain spaces.
kk: Жарамсыз негізгі тақырып. Тіркелгі деректері жолында бос орындар болмауы керек.
ru: Недействительный базовый заголовок. Строка учетных данных не должна содержать пробелов.

source: Invalid basic header. Credentials not correctly base64 encoded.
kk: Жарамсыз негізгі тақырып. Тіркелгі деректері дұрыс base64 кодталмаған.
ru: Недействительный базовый заголовок. Учетные данные закодированы в base64 некорректно.

source: Invalid username/password.
kk: Қолданушы аты немесе құпия сөз жарамсыз.
ru: Неверное имя пользователя или пароль.

source: User inactive or deleted.
kk: Қолданушы белсенді емес немесе жойылған.
ru: Пользователь неактивен или удален.

source: Invalid token header. No credentials provided.
kk: Жарамсыз токен тақырыбы. Ешқандай тіркелгі деректері берілмеген.
ru: Недействительный заголовок токена. Учетные данные не предоставлены.

source: Invalid token header. Token string should not contain spaces.
kk: Жарамсыз токен тақырыбы. Токен жолында бос орындар болмауы керек.
ru: Недействительный заголовок токена. Строка токена не должна содержать пробелов.

source: Invalid token header. Token string should not contain invalid characters.
kk: Жарамсыз токен тақырыбы. Токен жолында жарамсыз таңбалар болмауы керек.
ru: Недействительный заголовок токена. Строка токена не должна содержать недопустимые символы.

source: Invalid token.
kk: Жарамсыз токен.
ru: Недействительный токен.

source: Auth Token
kk: Аутентификация токені
ru: Токен аутентификации

source: Key
kk: Кілт
ru: Ключ

source: User
kk: Қолданушы
ru: Пользователь

source: Created
kk: Құрылды
ru: Создан

source: Token
kk: Токен
ru: Токен

source: Tokens
kk: Токендер
ru: Токены

source: Username
kk: Қолданушы аты
ru: Имя пользователя

source: Password
kk: Құпия сөз
ru: Пароль

source: Unable to log in with provided credentials.
kk: Берілген тіркелгі деректерімен жүйеге кіру мүмкін емес.
ru: Не удалось войти с предоставленными учетными данными.

source: Must include "username" and "password".
kk: "Қолданушы аты" және "құпия сөз" енгізілуі керек.
ru: Необходимо указать "имя пользователя" и "пароль".

source: A server error occurred.
kk: Сервер қатесі орын алды.
ru: Произошла ошибка сервера.

source: Invalid input.
kk: Жарамсыз енгізу.
ru: Недопустимый ввод.

source: Malformed request.
kk: Қате сұраныс.
ru: Некорректный запрос.

source: Incorrect authentication credentials.
kk: Аутентификация деректері дұрыс емес.
ru: Некорректные учетные данные.

source: Authentication credentials were not provided.
kk: Аутентификация деректері берілмеген.
ru: Учетные данные не были предоставлены.

source: You do not have permission to perform this action.
kk: Бұл әрекетті орындауға сізде рұқсат жоқ.
ru: У вас нет разрешения на выполнение этого действия.

source: Not found.
kk: Табылмады.
ru: Не найдено.

source: Method "{method}" not allowed.
kk: "{method}" әдісіне рұқсат жоқ.
ru: Метод "{method}" не разрешен.

source: Could not satisfy the request Accept header.
kk: Сұраныстың Accept тақырыбы қанағаттандырылмады.
ru: Не удалось удовлетворить заголовок Accept запроса.

source: Unsupported media type "{media_type}" in request.
kk: Сұраныста қолдау көрсетілмейтін медиа түрі "{media_type}".
ru: Неподдерживаемый тип медиа "{media_type}" в запросе.

source: Request was throttled.
kk: Сұраныс шектелді.
ru: Запрос был ограничен.

source: Expected available in {wait} second.
kk: {wait} секунд ішінде қолжетімді болады деп күтілуде.
ru: Ожидается доступность через {wait} секунду.

source: Expected available in {wait} seconds.
kk: {wait} секунд ішінде қолжетімді болады деп күтілуде.
ru: Ожидается доступность через {wait} секунд.

source: This field is required.
kk: Бұл өріс міндетті.
ru: Это поле обязательно для заполнения.

source: This field may not be null.
kk: Бұл өріс бос болмауы керек.
ru: Это поле не может быть пустым.

source: Must be a valid boolean.
kk: Дұрыс бульдік мән болуы керек.
ru: Должно быть допустимое булево значение.

source: Not a valid string.
kk: Жарамсыз жол.
ru: Недопустимая строка.

source: This field may not be blank.
kk: Бұл өріс бос болмауы керек.
ru: Это поле не может быть пустым.

source: Ensure this field has no more than {max_length} characters.
ru: Убедитесь, что это поле содержит не более {max_length} символов.

source: Ensure this field has at least {min_length} characters.
ru: Убедитесь, что это поле содержит не менее {min_length} символов.

source: Enter a valid email address.
kk: Жарамды электрондық пошта мекенжайын енгізіңіз.
ru: Введите действительный адрес электронной почты.

source: This value does not match the required pattern.
kk: Бұл мән қажетті үлгіге сәйкес келмейді.
ru: Это значение не соответствует требуемому шаблону.

source: Enter a valid "slug" consisting of letters, numbers, underscores or hyphens.
kk: Әріптерден, сандардан, астын сызу немесе сызықшалардан тұратын дұрыс "slug" енгізіңіз.
ru: Введите допустимый "слаг", состоящий из букв, цифр, подчеркиваний или дефисов.

source: Enter a valid "slug" consisting of Unicode letters, numbers, underscores, or hyphens.
kk: Юникод әріптерінен, сандардан, астын сызу немесе сызықшалардан тұратын дұрыс "slug" енгізіңіз.
ru: Введите допустимый "слаг", состоящий из символов Unicode, цифр, подчеркиваний или дефисов.

source: Enter a valid URL.
kk: Дұрыс URL енгізіңіз.
ru: Введите допустимый URL.

source: Must be a valid UUID.
kk: Дұрыс UUID болуы керек.
ru: Должно быть допустимое значение UUID.

source: Enter a valid IPv4 or IPv6 address.
kk: Дұрыс IPv4 немесе IPv6 мекенжайын енгізіңіз.
ru: Введите допустимый адрес IPv4 или IPv6.

source: A valid integer is required.
kk: Дұрыс бүтін сан қажет.
ru: Требуется допустимое целое число.

source: Ensure this value is less than or equal to {max_value}.
kk: Бұл мән {max_value} мәнінен аз немесе тең екеніне көз жеткізіңіз.
ru: Убедитесь, что это значение меньше или равно {max_value}.

source: Ensure this value is greater than or equal to {min_value}.
kk: Бұл мән {min_value} мәнінен көп немесе тең екеніне көз жеткізіңіз.
ru: Убедитесь, что это значение больше или равно {min_value}.

source: String value too large.
kk: Жол мәні тым үлкен.
ru: Строковое значение слишком велико.

source: A valid number is required.
kk: Дұрыс сан қажет.
ru: Требуется допустимое число.

source: Ensure that there are no more than {max_digits} digits in total.
kk: Жалпы {max_digits} цифрдан аспайтындығына көз жеткізіңіз.
ru: Убедитесь, что всего не более {max_digits} цифр.

source: Ensure that there are no more than {max_decimal_places} decimal places.
kk: {max_decimal_places} ондық таңбадан аспайтындығына көз жеткізіңіз.
ru: Убедитесь, что количество десятичных знаков не превышает {max_decimal_places}.

source: Ensure that there are no more than {max_whole_digits} digits before the decimal point.
kk: Ондық нүктеге дейін {max_whole_digits} цифрдан аспайтындығына көз жеткізіңіз.
ru: Убедитесь, что количество цифр перед десятичной точкой не превышает {max_whole_digits}.

source: Datetime has wrong format. Use one of these formats instead: {format}.
kk: Күні мен уақытының форматы дұрыс емес. Келесі форматтардың бірін қолданыңыз: {format}.
ru: Дата и время имеют неверный формат. Используйте один из следующих форматов: {format}.

source: Expected a datetime but got a date.
kk: Күні мен уақыты күтілді, бірақ тек күн алынды.
ru: Ожидалось значение даты и времени, но получена только дата.

source: Invalid datetime for the timezone "{timezone}".
kk: "{timezone}" уақыт белдеуі үшін жарамсыз күні мен уақыты.
ru: Недопустимое значение даты и времени для часового пояса "{timezone}".

source: Datetime value out of range.
kk: Күні мен уақыты диапазоннан тыс.
ru: Значение даты и времени выходит за допустимые пределы.

source: Date has wrong format. Use one of these formats instead: {format}.
kk: Күннің форматы дұрыс емес. Келесі форматтардың бірін қолданыңыз: {format}.
ru: Дата имеет неверный формат. Используйте один из следующих форматов: {format}.

source: Expected a date but got a datetime.
kk: Күн күтілді, бірақ күні мен уақыты алынды.
ru: Ожидалась дата, но получено значение даты и времени.

source: Time has wrong format. Use one of these formats instead: {format}.
kk: Уақыт форматы дұрыс емес. Келесі форматтардың бірін қолданыңыз: {format}.
ru: Время имеет неверный формат. Используйте один из следующих форматов: {format}.

source: Duration has wrong format. Use one of these formats instead: {format}.
kk: Ұзақтығының форматы дұрыс емес. Келесі форматтардың бірін қолданыңыз: {format}.
ru: Длительность имеет неверный формат. Используйте один из следующих форматов: {format}.

source: "{input}" is not a valid choice.
kk: "{input}" жарамды таңдау емес.
ru: "{input}" не является допустимым вариантом.

source: More than {count} items...
kk: {count} элементтен көп...
ru: Более {count} элементов...

source: Expected a list of items but got type "{input_type}".
kk: Элементтер тізімі күтілді, бірақ "{input_type}" түрі алынды.
ru: Ожидался список элементов, но получен тип "{input_type}".

source: This selection may not be empty.
kk: Бұл таңдау бос болмауы керек.
ru: Этот выбор не может быть пустым.

source: "{input}" is not a valid path choice.
kk: "{input}" жарамды жол таңдауы емес.
ru: "{input}" не является допустимым путем.

source: No file was submitted.
kk: Ешқандай файл жіберілген жоқ.
ru: Файл не был отправлен.

source: The submitted data was not a file. Check the encoding type on the form.
kk: Жіберілген деректер файл емес. Форманың кодтау түрін тексеріңіз.
ru: Отправленные данные не являются файлом. Проверьте тип кодировки в форме.

source: No filename could be determined.
kk: Файл атауы анықталмады.
ru: Имя файла определить не удалось.

source: The submitted file is empty.
kk: Жіберілген файл бос.
ru: Отправленный файл пуст.

source: Ensure this filename has at most {max_length} characters (it has {length}).
kk: Бұл файл атауы ең көбі {max_length} таңбадан аспайтындығына көз жеткізіңіз ({length} таңба бар).
ru: Убедитесь, что длина имени файла не превышает {max_length} символов (сейчас {length}).

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
kk: Жарамды кескінді жүктеңіз. Сіз жүктеген файл не кескін емес, не бүлінген кескін.
ru: Загрузите допустимое изображение. Отправленный файл либо не является изображением, либо поврежден.

source: This list may not be empty.
kk: Бұл тізім бос болмауы керек.
ru: Этот список не может быть пустым.

source: Ensure this field has at least {min_length} elements.
kk: Бұл өрісте кемінде {min_length} элемент болуы керек екенін тексеріңіз.
ru: Убедитесь, что это поле содержит как минимум {min_length} элементов.

source: Ensure this field has no more than {max_length} elements.
kk: Бұл өрісте {max_length} элементтен артық болмауын тексеріңіз.
ru: Убедитесь, что это поле содержит не более {max_length} элементов.

source: Expected a dictionary of items but got type "{input_type}".
kk: Элементтердің сөздігі күтілді, бірақ "{input_type}" түрі алынды.
ru: Ожидался словарь элементов, но получен тип "{input_type}".

source: This dictionary may not be empty.
kk: Бұл сөздік бос болмауы керек.
ru: Этот словарь не может быть пустым.

source: Value must be valid JSON.
kk: Мән жарамды JSON болуы керек.
ru: Значение должно быть допустимым JSON.

source: Search
kk: Іздеу
ru: Поиск

source: A search term.
kk: Іздеу термині.
ru: Поисковый запрос.

source: Ordering
kk: Сұрыптау
ru: Сортировка

source: Which field to use when ordering the results.
kk: Нәтижелерді сұрыптау үшін қай өрісті пайдалану керек.
ru: Какое поле использовать для сортировки результатов.

source: ascending
kk: өсіп келе жатқан
ru: по возрастанию

source: descending
kk: кеміп келе жатқан
ru: по убыванию

source: A page number within the paginated result set.
kk: Беттелген нәтижелер жиынындағы бет нөмірі.
ru: Номер страницы в наборе разбиения на страницы.

source: Number of results to return per page.
kk: Бір бетке қайтарылатын нәтиже саны.
ru: Количество результатов на странице.

source: Invalid page.
kk: Жарамсыз бет.
ru: Недопустимая страница.

source: The initial index from which to return the results.
kk: Нәтижелерді қайтару басталатын бастапқы индекс.
ru: Начальный индекс, с которого возвращаются результаты.

source: The pagination cursor value.
kk: Беттеу курсорының мәні.
ru: Значение курсора разбиения на страницы.

source: Invalid cursor
kk: Жарамсыз курсор
ru: Недопустимый курсор

source: Invalid pk "{pk_value}" - object does not exist.
kk: Жарамсыз pk "{pk_value}" - объект жоқ.
ru: Недопустимый pk "{pk_value}" - объект не существует.

source: Incorrect type. Expected pk value, received {data_type}.
kk: Қате түр. pk мәні күтілді, бірақ {data_type} алынды.
ru: Некорректный тип. Ожидалось значение pk, получен {data_type}.

source: Invalid hyperlink - No URL match.
kk: Жарамсыз гиперсілтеме - URL сәйкес келмейді.
ru: Недопустимая гиперссылка - URL не найден.

source: Invalid hyperlink - Incorrect URL match.
kk: Жарамсыз гиперсілтеме - Қате URL сәйкестігі.
ru: Недопустимая гиперссылка - неверное соответствие URL.

source: Invalid hyperlink - Object does not exist.
kk: Жарамсыз гиперсілтеме - Объект жоқ.
ru: Недопустимая гиперссылка - объект не существует.

source: Incorrect type. Expected URL string, received {data_type}.
kk: Қате түр. URL жолы күтілді, бірақ {data_type} алынды.
ru: Некорректный тип. Ожидалась строка URL, получен {data_type}.

source: Object with {slug_name}={value} does not exist.
kk: {slug_name}={value} объектісі жоқ.
ru: Объект с {slug_name}={value} не существует.

source: Invalid value.
kk: Жарамсыз мән.
ru: Недопустимое значение.

source: unique integer value
kk: бірегей бүтін сан мәні
ru: уникальное целочисленное значение

source: UUID string
kk: UUID жолы
ru: Строка UUID

source: unique value
kk: бірегей мән
ru: уникальное значение

source: A {value_type} identifying this {name}.
kk: Бұл {name} сәйкестендіретін {value_type}.
ru: {value_type}, идентифицирующий {name}.

source: Invalid data. Expected a dictionary, but got {datatype}.
kk: Жарамсыз деректер. Сөздік күтілді, бірақ {datatype} алынды.
ru: Некорректные данные. Ожидался словарь, но получен {datatype}.

source: Extra Actions
ru: Дополнительные действия

source: Filters
ru: Фильтры

source: navbar
ru: навигационная панель

source: content
ru: содержимое

source: request form
ru: форма запроса

source: main content
ru: основное содержимое

source: request info
ru: информация о запросе

source: response info
ru: информация о ответе

source: None
ru: Нет

source: No items to select.
ru: Нет доступных элементов для выбора.

source: This field must be unique.
kk: Бұл өріс бірегей болуы керек.
ru: Это поле должно быть уникальным.

source: The fields {field_names} must make a unique set.
kk: {field_names} өрістері бірегей жиын болуы керек.
ru: Поля {field_names} должны образовывать уникальный набор.

source: Surrogate characters are not allowed: U+{code_point:X}.
kk: Суррогат таңбаларға рұқсат етілмейді: U+{code_point:X}.
ru: Суррогатные символы недопустимы: U+{code_point:X}.

source: This field must be unique for the "{date_field}" date.
kk: Бұл өріс "{date_field}" күні үшін бірегей болуы керек.
ru: Это поле должно быть уникальным для даты "{date_field}".

source: This field must be unique for the "{date_field}" month.
kk: Бұл өріс "{date_field}" айы үшін бірегей болуы керек.
ru: Это поле должно быть уникальным для месяца "{date_field}".

source: This field must be unique for the "{date_field}" year.
kk: Бұл өріс "{date_field}" жылы үшін бірегей болуы керек.
ru: Это поле должно быть уникальным для года "{date_field}".

source: Invalid version in "Accept" header.
kk: "Accept" тақырыбында жарамсыз нұсқа.
ru: Недопустимая версия в заголовке "Accept".

source: Invalid version in URL path.
kk: URL жолында жарамсыз нұсқа.
ru: Недопустимая версия в пути URL.

source: Invalid version in URL path. Does not match any version namespace.
kk: URL жолында жарамсыз нұсқа. Ешбір нұсқа кеңістігіне сәйкес келмейді.
ru: Недопустимая версия в пути URL. Не соответствует ни одному пространству имен версий.

source: Invalid version in hostname.
kk: Хост атауында жарамсыз нұсқа.
ru: Недопустимая версия в имени хоста.

source: Invalid version in query parameter.
kk: Сұрау параметрінде жарамсыз нұсқа.
ru: Недопустимая версия в параметре запроса.

source: Enter a valid username. This value may contain only letters, numbers, and @/./+/-/_ characters.
kk: Жарамды пайдаланушы атын енгізіңіз. Бұл мәнде тек әріптер, сандар және @/./+/-/_ таңбалары болуы мүмкін.
ru: Введите действительное имя пользователя. Это значение может содержать только буквы, цифры и символы @/./+/-/_.

source: This password is too short. It must contain at least %(min_length)d character.
kk: Бұл құпия сөз тым қысқа. Ол кемінде %(min_length)d таңба болуы керек.
ru: Этот пароль слишком короткий. Он должен содержать хотя бы %(min_length)d символ.

source: This password is too common.
kk: Бұл құпия сөз тым жиі кездеседі.
ru: Этот пароль слишком распространен.

source: Company
kk: Заңды тұлға
ru: Юридические лицо

source: Individual
kk: Жеке
ru: Физическое лицо

source: Cannot delete this partner because it is referenced in another record.
ru: Невозможно удалить этого контрагента, поскольку на него есть ссылка в другой записи.

source: Invoice amount must be a positive number.
ru: Сумма Инвойса должна быть положительным числом.

source: Payment amount must be a positive number.
ru: Сумма платежа должна быть положительным числом.

source: Item locked successfully.
ru: Элемент успешно заблокирован.

source: Item unlocked successfully.
ru: Элемент успешно разблокирован.

source: You cannot unlock this item.
ru: Вы не можете разблокировать этот предмет.

source: This item is locked by
ru: Этот элемент заблокирован

source: Time remaining
ru: Оставшееся время

source: Version is required to update the record.
ru: Версия необходима для обновления записи.

source: The record has been updated by another user. Please refresh the page and try again.
ru: Запись была обновлена ​​другим пользователем. Пожалуйста, обновите страницу и повторите попытку.

source: The item deleted successfully.
ru: Элемент успешно удален.

source: Cannot delete this item because it is referenced in another record.
ru: Невозможно удалить этот элемент, поскольку на него есть ссылка в другой записи.
